/**
 * Created by dongxin on 2016-10-18.
 */

var time;
var indexTime = 0;
//var arrayData = [231,271,312,169,228,303,135,234,232,237,191,201,232,309,239,216,177,210,236,244,152,210,210,293,247,231,278,246,202,197,224,223,291,234,167,234,194,273,182,235,222,266,240,281,233,262,253,199,214,230,194,237,189,266,245,168,202,272,191,226,216,230,198,209,253,242,186,222,307,167,169,234,344,259,241,177,176,200,216,217,231,279,157,292,267,209,269,211,182,237,216,239,247,280,222,149,199,138,214,192,189,219,261,192,202,293,251,249,212,306,174,236,237,208,281,183,213,231,202,255,283,228,277,264,213,256,213,228,190,176,102,267,237,169,263,383,240,210,263,289,260,154,226,164,192,260,219,211,297,283,231,232,180,203,233,303,197,209,210,257,228,148,271,203,191,219,276,259,235,223,249,153,186,264,197,306,172,201,278,188,233,225,306,226,198,231,246,242,206,194,286,256,258,238,228,212,195,268,192,189,247,259,229,196,215,183,179,172,227,227,201,299,250,243,229,251,185,244,266,177,233,227,213,199,222,266,259,215,249,125,228,246,213,208,348,227,200,183,169,276,267,228,278,252,91,232,184,276,221,228,165,123,114,222,172,158,249,230,283,194,186,202,258,254,229,255,229,177,226,195,252,299,226,208,231,302,238,260,217,255,289,225,209,275,245,262,247,240,247,134,291,264,183,203,222,227,269,236,207,277,239,272,213,222,199,225,206,195,186,277,235,157,234,213,214,210,279,259,212,234,225,251,277,236,225,205,242,177,264,204,224,240,235,190,318,274,192,236,134,224,230,235,246,159,269,272,176,243,186,355,285,222,247,152,178,141,284,207,236,235,184,193,219,243,222,255,268,243,253,249,190,277,216,285,215,272,203,248,232,318,208,166,246,303,251,255,176,210,182,253,303,238,267,215,315,243,277,288,195,209,261,244,168,231,185,228,255,278,228,144,290,252,181,181,192,266,223,180,212,190,243,283,245,162,250,209,226,188,196,271,330,233,214,220,306,203,208,188,260,307,281,208,197,193,263,234,273,243,220,158,184,158,198,169,192,178,210,286,200,208,195,243,245,163,191,268,207,144,221,263,248,230,197,232,252,252,261,172,233,251,277,260,192,275,191,203,259,152,188,178,275,216,246,183,186,263,222,164,252,287,231,271,312,169,228,303,135,234,232,237,191,201,232,309,239,216,177,210,236,244,152,210,210,293,247,231,278,246,202,197,224,223,291,234,167,234,194,273,182,235,222,266,240,281,233,262,253,199,214,230,194,237,189,266,245,168,202,272,191,226,216,230,198,209,253,242,186,222,307,167,169,234,344,259,241,177,176,200,216,217,231,279,157,292,267,209,269,211,182,237,216,239,247,280,222,149,199,138,214,192,189,219,261,192,202,293,251,249,212,306,174,236,237,208,281,183,213,231,202,255,283,228,277,264,213,256,213,228,190,176,102,267,237,169,263,383,240,210,263,289,260,154,226,164,192,260,219,211,297,283,231,232,180,203,233,303,197,209,210,257,228,148,271,203,191,219,276,259,235,223,249,153,186,264,197,306,172,201,278,188,233,225,306,226,198,231,246,242,206,194,286,256,258,238,228,212,195,268,192,189,247,259,229,196,215,183,179,172,227,227,201,299,250,243,229,251,185,244,266,177,233,227,213,199,222,266,259,215,249,125,228,246,213,208,348,227,200,183,169,276,267,228,278,252,91,232,184,276,221,228,165,123,114,222,172,158,249,230,283,194,186,202,258,254,229,255,229,177,226,195,252,299,226,208,231,302,238,260,217,255,289,225,209,275,245,262,247,240,247,134,291,264,183,203,222,227,269,236,207,277,239,272,213,222,199,225,206,195,186,277,235,157,234,213,214,210,279,259,212,234,225,251,277,236,225,205,242,177,264,204,224,240,235,190,318,274,192,236,134,224,230,235,246,159,269,272,176,243,186,355,285,222,247,152,178,141,284,207,236,235,184,193,219,243,222,255,268,243,253,260,228,237,279,194,272,229,257,204,235,234,188,183,161,270,239,166,231,212,287,250,279,234,206,191,233,234,205,195,215,201,239,188,236,190,319,296,224,184,127,215,272,230,278,248,183,272,250,255,242,184,231,190,273,214,255,213,147,202,156,277,181,217,286,222,283,260,204,268,227,207,200,265,243,202,283,126,234,277,282,112,160,171,221,180,244,262,277,235,233,299,313,106,223,164,232,238,252,174,204,278,256,206,199,228,309,199,216,145,243,165,227,219,221,242,181,132,269,268,157,246,250,191,214,258,194,190,174,278,288,176,192,280,297,184,257,252,306,170,260,237,231,264,221,290,204,200,251,283,257,302,204,275,200,334,197,283,229,179,270,224,248,206,249,260,183,173,197,196,197,266,246,172,292,215,223,250,270,184,311,248,255,268,212,252,296,191,227,229,285,239,205,267,241,233,201,256,181,187,277,180,177,294,157,212,226,252,207,276,210,221,234,240,271,258,235,282,207,203,224,177,157,237,259,274,194,279,256,295,199,294,209,225,227,210,211,233,304,217,269,261,248,258,240,240,242,241,256,136,229,189,222,189,183,291,222,238,223,278,189,312,200,227,251,281,258,201,248,166,181,121,284,188,207,261,222,197,226,154,260,218,271,148,242,239,171,203,214,264,229,191,247,264,222,136,275,250,178,212,253,275,266,281,163,175,225,159,206,199,264,190,211,228,173,254,228,270,278,115,182,289,115,195,309,215,162,238,257,182,286,248,207,149,188,182,250,185,223,196,314,297,256,197,264,243,268,253,237,192,230,231,221,268,190,310,302,250,202,258,223,201,287,224,172,173,199,243,131,276,216,217,247,227,182,277,198,236,260,168,249,170,184,226,221,223,178,151,321,135,238,188,209,271,179,212,204,236,224,179,147,220,204,197,220,210,213,240,245,295,203,215,303,212,243,259,230,207,317,203,269,195,241,222,244,190,211,243,181,177,210,226,229,247,280,292,226,223,268,216,285,207,228,228,269,128,176,205,281,264,287,260,206,171,204,223,277,168,226,223,197,281,203,254,310,283,272,224,289,213,221,271,217,284,271,167,254,261,263,269,215,240,207,178,166,191,210,115,154,253,265,318,247,221,263,265,253,181,152,219,216,210,207,219,163,276,221,169,211,187,244,165,290,226,251,218,162,160,235,265,197,213,268,271,195,199,324,215,331,191,262,236,272,258,314,242,221,195,263,197,226,242,230,204,240,227,233,216,169,186,227,200,215,169,190,176,236,186,153,233,142,292,200,266,287,160,226,201,254,284,257,233,223,168,214,195,221,239,223,222,216,324,181,254,207,241,323,149,132,178,266,280,216,249,235,180,205,250,235,239,147,194,216,246,239,229,206,230,281,168,171,271,279,240,255,168,191,201,289,224,123,256,290,205,185,169,226,308,261,164,296,104,];
//var arrayData = [231,271,312,169,228,303,135,234,232,237,191,201,232,309,239,216,177,210,236,244,152,210,210,293,247,231,278,246,202,197,224,223,291,234,167,234,194,273,182,235,222,266,240,281,233,262,253,199,214,230,194,237,189,266,245,168,202,272,191,226,216,230,198,209,253,242,186,222,307,167,169,234,344,259,241,177,176,200,216,217,231,279,157,292,267,209,269,211,182,237,216,239,247,280,222,149,199,138,214,192,189,219,261,192,202,293,251,249,212,306,174,236,237,208,281,183,213,231,202,255,283,228,277,264,213,256,213,228,190,176,102,267,237,169,263,383,240,210,263,289,260,154,226,164,192,260,219,211,297,283,231,232,180,203,233,303,197,209,210,257,228,148,271,203,191,219,276,259,235,223,249,153,186,264,197,306,172,201,278,188,233,225,306,226,198,231,246,242,206,194,286,256,258,238,228,212,195,268,192,189,247,259,229,196,215,183,179,172,227,227,201,299,250,243,229,251,185,244,266,177,233,227,213,199,222,266,259,215,249,125,228,246,213,208,348,227,200,183,169,276,267,228,278,252,91,232,184,276,221,228,165,123,114,222,172,158,249,230,283,194,186,202,258,254,229,255,229,177,226,195,252,299,226,208,231,302,238,260,217,255,289,225,209,275,245,262,247,240,247,134,291,264,183,203,222,227,269,236,207,277];
var arrayData = [231,271,312,169,228,303,135,234,232,237,191,201,232,309,239,216,177,210,236,244,152,210,210,293,247,231,278,246,202,197,224,223,291,234,167,234,194,273,182,235,222,266,240,281,233,262,253,199,214,230,194,237,189,266,245,168,202,272,191,226,216,230,198,209,253,242,186,222,307,167,169,234,344,259,241,177,176,200,216,217,231,279,157,292,267,209,269,211,182,237,216,239,247,280,222,149,199,138,214,192,189,219,261,192,202,293,251,249,212,306,174,236,237,208,281,183,213,231,202,255];
var shishizhilingduilieArray = [];
var shishizhilingduilieTextArray = [];
//var numberType = [['温度','湿度','声音','光照','水流量','气压','速度','重量','溶解氧'],
//['超出阈值','低于阈值','发生变化','变化幅度溢出'],['报告状态','休眠','发送数据','停止'],['水利局','气象局','环保局','交通运输委员会','安监局'],
//    ['℃','%','DB','lux','m³','hPa','m/s','Kg','mg']];
var numberType = [['温度','湿度','声音','光照','水流量','气压','速度','重量','溶解氧'],['℃','%','DB','lux','m³','hPa','m/s','Kg','mg']];
var wareType = [['温度','湿度','声音','光照','水流量','气压','速度','重量','溶解氧'],['超出阈值','低于阈值','发生变化','变化幅度溢出']];
var orderType = [['水利局','气象局','环保局','交通运输委员会','安监局'],['报告状态','休眠','发送数据','停止'],['温度','湿度','声音','光照','水流量','气压','速度','重量','溶解氧']];

(function initffff(){

    $(document).ready(function(){
        $('#sjyzltst_top').children().eq(0).children().eq(0).css({
            color:'#4be4fa'
        });
        $("#ssfbsjl_top").children().css({
            "color":"#4be4fa",
            height:'48px',
            "border-bottom":"#00a2ff solid 2px"
        });
        $("#sbfbsjl_top").children().css({
            "color":"#4be4fa",
            height:'48px',
            "border-bottom":"#00a2ff solid 2px"
        });
        if(time){
            clearTimeout(time);
            initFuDownLoad();
        }else{
            initFuDownLoad();
        }

        shishizhilingduilie();
    });
})();

function initFuDownLoad(){

    if(dataCreat()[1]>1024){
        $('.yxjk_left_s_b_bottom_b').eq(indexTime).children().eq(0).html((dataCreat()[1]/1024).toFixed(2)+'MB/s');
    }else{
        $('.yxjk_left_s_b_bottom_b').eq(indexTime).children().eq(0).html((dataCreat()[1])+'KB/s');
    }

    for(var i = 0;i< $('.yxjk_left_s_b_bottom_c').children().eq(indexTime).children().length;i++){
        $('.yxjk_left_s_b_bottom_c').children().eq(indexTime).children().eq(i).children().last().html(dataCreat()[0][i]+'KB/s');
    }

    time = setTimeout('initFuDownLoad()',1000);

}

function dataCreat(){

    var num = 50;

    if(indexTime == 0){
        num = 50;
    }else if(indexTime == 1){
        num = 500;
    }

    var data1 = [];
    var data2 = 0;
    for(var i=0;i<$('.yxjk_left_s_b_bottom_c').children().eq(0).children().length;i++){
        data1.push(Math.round(Math.random() * num));
    }

    for(var i = 0;i<data1.length;i++){
        data2 += data1[i];
    }

    arrayData.shift();
    arrayData.push(data2);

    return [data1,data2];
}

var interval = 1000;

function shishizhilingduilie(){

    var date = (new Date()).getTime();
    //var timeSS = date%3600000%60000%1000;
    //var timeS = (date%3600000%60000-date%3600000%60000%1000)/1000;
    //var timeM = (date%3600000-date%3600000%60000)/60000;
    ////var timeH = (date-date%3600000)/3600000;
    //var timeH = (new Date()).getHours();

    var shishizhiliDataArray = [];

    for(var i = 0;i<10;i++){
        shishizhiliDataArray.push(date-Math.round(Math.random()*600)*1000);
    }

    (shishizhiliDataArray.sort()).reverse();
    for(var i = 0;i<10;i++){
        //console.log(new Date(shishizhiliDataArray[i]));
        shishizhilingduilieArray.push((new Date(shishizhiliDataArray[i])).getHours()+':'+((new Date(shishizhiliDataArray[i])).getMinutes()>9?(new Date(shishizhiliDataArray[i])).getMinutes():('0'+(new Date(shishizhiliDataArray[i])).getMinutes()))+':'
        +((new Date(shishizhiliDataArray[i])).getSeconds()>9?(new Date(shishizhiliDataArray[i])).getSeconds():('0'+(new Date(shishizhiliDataArray[i])).getSeconds())));
        shishizhilingduilieTextArray.push(reloadShishizhilingduilieText());
    }




    for(var i = 0;i<$('.yxjk_right_b_bottom').children().first().children().length;i++){
        $('.yxjk_right_b_bottom').children().first().children().eq(i).children().eq(0).html(shishizhilingduilieArray[i]);
        $('.yxjk_right_b_bottom').children().first().children().eq(i).children().eq(1).html(shishizhilingduilieTextArray[i]);
        //$('.yxjk_right_b_bottom').children().first().children().eq(i).children().eq(1).attr('title',shishizhilingduilieTextArray[i]);

        //console.log((shishizhilingduilieTextArray[i]).length);
        //console.log((shishizhilingduilieArray[i]));
        if((shishizhilingduilieTextArray[i]).length>=24){
            $('.yxjk_right_b_bottom_right').eq(i).css({
                height:'78px',
                lineHeight:'39px'
            });
            //$('.yxjk_right_b_bottom_left').eq(i).css({
            //    lineHeight:'50px',
            //    height:'50px'
            //});
            $('.yxjk_right_b_bottom ul li').eq(i).css({
                height:'78px',
                lineHeight:'39px'
            });
        }else{
            $('.yxjk_right_b_bottom_right').eq(i).css({
                height:'39px',
                lineHeight:'39px'
            });
            //$('.yxjk_right_b_bottom_left').eq(i).css({
            //    lineHeight:'39px',
            //    height:'39px'
            //});
            $('.yxjk_right_b_bottom ul li').eq(i).css({
                height:'39px',
                lineHeight:'39px'
            });
        }

    }

    var time = setTimeout('timeshishizhilingliedui(time)',interval);

}

function timeshishizhilingliedui(){
    interval = (Math.round(Math.random()*30))*1000;

    shishizhilingduilieArray.pop();
    shishizhilingduilieArray.unshift(((new Date()).getHours()+':'+((new Date()).getMinutes()>9?(new Date()).getMinutes():('0'+(new Date()).getMinutes()))+':'+((new Date()).getSeconds()>9?(new Date()).getSeconds():('0'+(new Date()).getSeconds()))));
    shishizhilingduilieTextArray.pop();
    shishizhilingduilieTextArray.unshift(reloadShishizhilingduilieText());

    for(var i = 0;i<$('.yxjk_right_b_bottom').children().first().children().length;i++){

        $('.yxjk_right_b_bottom').children().first().children().eq(i).children().eq(0).html(shishizhilingduilieArray[i]);
        $('.yxjk_right_b_bottom').children().first().children().eq(i).children().eq(1).html(shishizhilingduilieTextArray[i]);

        if((shishizhilingduilieTextArray[i]).length>=23){
            $('.yxjk_right_b_bottom_right').eq(i).css({
                height:'78px',
                lineHeight:'39px'
            });
            //$('.yxjk_right_b_bottom_left').eq(i).css({
            //    lineHeight:'50px',
            //    height:'50px'
            //});
            $('.yxjk_right_b_bottom ul li').eq(i).css({
                height:'78px'
                //lineHeight:'25px'
            });
            //console.log((shishizhilingduilieTextArray[i]).length);
            //console.log((shishizhilingduilieTextArray[i]));
        }else{
            $('.yxjk_right_b_bottom_right').eq(i).css({
                height:'39px',
                lineHeight:'39px'
            });
            //$('.yxjk_right_b_bottom_left').eq(i).css({
            //    lineHeight:'39px',
            //    height:'39px'
            //});
            $('.yxjk_right_b_bottom ul li').eq(i).css({
                height:'39px'
                //lineHeight:'39px'
            });
        }

        if(i == 0){
            $('.yxjk_right_b_bottom').children().first().children().eq(i).slideUp(500);
            $('.yxjk_right_b_bottom').children().first().children().eq(i).slideDown(100);
        }
    }
    clearTimeout(time);
    var time = setTimeout('timeshishizhilingliedui(time)',interval);
}

//function rangeData(data1,data2){
//    var data = Math.random()*data2;
//    while(data<data1||data>data2){
//        data = Math.random()*data2;
//    }
//    return data;
//}

function reloadShishizhilingduilieText(){
    var numberType = [['温度','湿度','声音','光照','水流量','气压','速度','重量','溶解氧'],['℃','%','DB','lux','m³','hPa','m/s','Kg','mg']];
    var wareType = [['温度','湿度','声音','光照','水流量','气压','速度','重量','溶解氧'],['超出阈值','低于阈值','发生变化','变化幅度溢出']];
    var orderType = [['水利局','气象局','环保局','交通运输委员会','安监局'],['报告状态','休眠','发送数据','停止'],['温度','湿度','声音','光照','水流量','气压','速度','重量','溶解氧']];

    var index = lengthIndex(numberType[0]);
    var text01 = '从'+numberType[0][index]+'传感器'+Math.round(Math.random()*1000)+'接收数据，数值为'+rangeData(19,22)+numberType[1][index];
    var text02 = wareType[0][lengthIndex(wareType[0])]+'传感器'+Math.round(Math.random()*1000)+'触发警报，数值'+wareType[1][lengthIndex(wareType[1])];
    var text03 = '用户"'+orderType[0][lengthIndex(orderType[0])]+'"发送指令"'+orderType[1][lengthIndex(orderType[1])]+'"至'+orderType[2][lengthIndex(orderType[2])]+'传感器'+Math.round(Math.random()*1000);

    var textArray = [text01,text02,text03];


    index = lengthIndex(numberType[0]);
    text01 = '从'+numberType[0][index]+'传感器'+Math.round(Math.random()*1000)+'接收数据，数值为'+rangeData(19,22)+numberType[1][index];
    text02 = wareType[0][lengthIndex(wareType[0])]+'传感器'+Math.round(Math.random()*1000)+'触发警报，数值'+wareType[1][lengthIndex(wareType[1])];
    text03 = '用户“'+orderType[0][lengthIndex(orderType[0])]+'”发送指令“'+orderType[1][lengthIndex(orderType[1])]+'”至'+orderType[2][lengthIndex(orderType[2])]+'传感器'+Math.round(Math.random()*1000);
    textArray = [text01,text02,text03];


    return textArray[lengthIndex(textArray)];



    function rangeData(data1,data2){
        var data = Math.round(Math.random()*data2);
        while(data<data1||data>data2){
            data = Math.round(Math.random()*data2);
        }
        return data;
    }

    function lengthIndex(arr) {
        return Math.round(Math.random()*(arr.length-1));
    }
}

